rkz/extension/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
		</Properties>
	</Document>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_СоставИсполнителейИВремяВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_СоставИсполнителейИВремяВыполнения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЧасыФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПроизводства</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Documents/ПроизводственнаяОперация2_2/Ext/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ9/12] [ASHolyavko@1cbit.ru] [19.08.2024] +        
	Если ЗначениеЗаполнено(ЭтотОбъект.Этап) Тогда
		Комментарий = ЭтотОбъект.Этап.Комментарий;
		бит_Толеранс = ЭтотОбъект.Этап.бит_Толеранс;
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребований [ЛТ9/12] [ASHolyavko@1cbit.ru] [19.08.2024] -

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [24.11.2025] +        
	
	Если ЭтотОбъект.бит_СоставБригады.Количество() <> 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
		|	бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства КАК ДокументПроизводства,
		|	бит_СоставИсполнителейИВремяВыполнения.Бригада КАК Бригада,
		|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
		|	бит_СоставИсполнителейИВремяВыполнения.Должность КАК Должность,
		|	бит_СоставИсполнителейИВремяВыполнения.Разряд КАК Разряд,
		|	бит_СоставИсполнителейИВремяВыполнения.Начисление КАК Начисление
		|ИЗ
		|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
		|ГДЕ
		|	бит_СоставИсполнителейИВремяВыполнения.Смена = &Смена
		|	И бит_СоставИсполнителейИВремяВыполнения.ДокументПроизводства = &ДокументПроизводства";
		
		Запрос.УстановитьПараметр("ДокументПроизводства", Ссылка);
		Запрос.УстановитьПараметр("Смена", Ссылка.СменноеЗадание);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Смена.Установить(Ссылка.СменноеЗадание);
			НаборЗаписей.Отбор.ДокументПроизводства.Установить(Ссылка);	
			НаборЗаписей.Отбор.Бригада.Установить(ВыборкаДетальныеЗаписи.Бригада);		
			НаборЗаписей.Отбор.Сотрудник.Установить(ВыборкаДетальныеЗаписи.Сотрудник);
			НаборЗаписей.Отбор.Должность.Установить(ВыборкаДетальныеЗаписи.Должность);
			НаборЗаписей.Отбор.Разряд.Установить(ВыборкаДетальныеЗаписи.Разряд);
			НаборЗаписей.Отбор.Начисление.Установить(ВыборкаДетальныеЗаписи.Начисление);
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		Для Каждого СтрокаБригады Из ЭтотОбъект.бит_СоставБригады Цикл
			
			НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Смена.Установить(Ссылка.СменноеЗадание);
			НаборЗаписей.Отбор.ДокументПроизводства.Установить(Ссылка);
			
			Если ТипЗнч(Ссылка.Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
				НаборЗаписей.Отбор.Бригада.Установить(Ссылка.Исполнитель);
			КонецЕсли;
			
			НаборЗаписей.Отбор.Сотрудник.Установить(СтрокаБригады.Сотрудник);
			НаборЗаписей.Отбор.Должность.Установить(СтрокаБригады.Должность);
			НаборЗаписей.Отбор.Разряд.Установить(СтрокаБригады.Разряд);
			НаборЗаписей.Отбор.Начисление.Установить(СтрокаБригады.Начисление);
			
			Запись = НаборЗаписей.Добавить();
			Запись.Смена = Ссылка.СменноеЗадание;
			Запись.ДокументПроизводства = Ссылка;
			
			Если ТипЗнч(Ссылка.Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
				Запись.Бригада = Ссылка.Исполнитель;
			КонецЕсли;
			
			Запись.Сотрудник = СтрокаБригады.Сотрудник;
			Запись.Должность = СтрокаБригады.Должность;
			Запись.Разряд = СтрокаБригады.Разряд;
			Запись.Начисление = СтрокаБригады.Начисление;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	Иначе
		
		Если ТипЗнч(Ссылка.Исполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			
			//НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
			//НаборЗаписей.Отбор.Смена.Установить(Ссылка.СменноеЗадание);
			//НаборЗаписей.Отбор.ДокументПроизводства.Установить(Ссылка);			
			//НаборЗаписей.Отбор.Сотрудник.Установить(Ссылка.Исполнитель);
			//НаборЗаписей.Отбор.Должность.Установить(Справочники.Должности.ПустаяСсылка());
			//НаборЗаписей.Отбор.Разряд.Установить(Справочники.РазрядыКатегорииДолжностей.ПустаяСсылка());
			//НаборЗаписей.Отбор.Начисление.Установить(ПланыВидовРасчета.Начисления.ПустаяСсылка());
			//
			//Запись = НаборЗаписей.Добавить();
			//Запись.Смена = Ссылка.СменноеЗадание;
			//Запись.ДокументПроизводства = Ссылка;			
			//Запись.Сотрудник = Ссылка.Исполнитель;
			//Запись.Должность = Справочники.Должности.ПустаяСсылка();
			//Запись.Разряд = Справочники.РазрядыКатегорииДолжностей.ПустаяСсылка();
			//Запись.Начисление = ПланыВидовРасчета.Начисления.ПустаяСсылка();
			//
			//НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Регистратор КАК Регистратор,
	//	|	бит_СоставИсполнителейИВремяВыполнения.НомерСтроки КАК НомерСтроки,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Активность КАК Активность,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена КАК Смена,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ОперацияВыпуска КАК ОперацияВыпуска,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Бригада КАК Бригада,
	//	|	бит_СоставИсполнителейИВремяВыполнения.Сотрудник КАК Сотрудник,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ЧасыНорма КАК ЧасыНорма,
	//	|	бит_СоставИсполнителейИВремяВыполнения.ЧасыФакт КАК ЧасыФакт,
	//	|	бит_СоставИсполнителейИВремяВыполнения.КоличествоПлан КАК КоличествоПлан,
	//	|	бит_СоставИсполнителейИВремяВыполнения.КоличествоФакт КАК КоличествоФакт
	//	|ИЗ
	//	|	РегистрСведений.бит_СоставИсполнителейИВремяВыполнения КАК бит_СоставИсполнителейИВремяВыполнения
	//	|ГДЕ
	//	|	бит_СоставИсполнителейИВремяВыполнения.Смена = &Смена
	//	|	И бит_СоставИсполнителейИВремяВыполнения.ОперацияВыпуска <> &ОперацияВыпуска";
	//
	//Запрос.УстановитьПараметр("ОперацияВыпуска", ЭтотОбъект.Ссылка);
	//Запрос.УстановитьПараметр("Смена", ЭтотОбъект.СменноеЗадание);
	////Запрос.УстановитьПараметр("ЭтоБригада", ТипЗнч(ЭтотОбъект.Исполнитель) = Тип("СправочникСсылка.Бригады"));
	////Запрос.УстановитьПараметр("Исполнитель", ЭтотОбъект.Исполнитель);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	//НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Регистратор.Установить(Ссылка.СменноеЗадание);
	//НаборЗаписей.Записать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	
	//	ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
	//	
	//КонецЦикла;
	//
	////НаборЗаписей = РегистрыСведений.бит_СоставИсполнителейИВремяВыполнения.СоздатьНаборЗаписей();
	////НаборЗаписей.Отбор.Регистратор.Установить(Ссылка.СменноеЗадание);
	//
	//Если ТипЗнч(ЭтотОбъект.Исполнитель) = Тип("СправочникСсылка.Бригады") Тогда
	//	
	//	Для Каждого ТекСтрока Из ЭтотОбъект.бит_СоставБригады Цикл
	//		
	//		НоваяЗапись = НаборЗаписей.Добавить();
	//		
	//		НоваяЗапись.Бригада = ЭтотОбъект.Исполнитель;
	//		НоваяЗапись.Смена = ЭтотОбъект.СменноеЗадание; 
	//		НоваяЗапись.Регистратор = Ссылка;               
	//		НоваяЗапись.ОперацияВыпуска = Ссылка;
	//		НоваяЗапись.Сотрудник = ТекСтрока.Сотрудник;
	//		
	//		//Часы Норма рассчитывается значение из вида работ указанного на вкладке "Трудозатраты" в реквизите "(бит) Время выполнения" * на Количество. 
	//		//Если нет установленных норм для соответствующего сочетания Номенклатуры/Оборудования/ТипаОперации, значение устанавливать "0" 
	//		//Количество автоматически пересчитывается по группе затрат соотнесенной с вкладкой "Продукция"
	//		
	//		НоваяЗапись.ЧасыНорма = 1;
	//		
	//		ЧасыФакт = 0;
	//		
	//		Если ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
	//			ЧасыФакт = ТекСтрока.ВремяФакт / 60;
	//		ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
	//			ЧасыФакт = ТекСтрока.ВремяФакт;
	//		ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.День Тогда	
	//			ЧасыФакт = ТекСтрока.ВремяФакт * 24;
	//		КонецЕсли;
	//		
	//		НоваяЗапись.ЧасыФакт = ЧасыФакт;
	//		
	//		НоваяЗапись.КоличествоПлан = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");
	//		НоваяЗапись.КоличествоФакт = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");	
	//		
	//	КонецЦикла;
	//	
	//Иначе
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	
	//	//НоваяЗапись.Бригада = ЭтотОбъект.Исполнитель;
	//	
	//	НоваяЗапись.Регистратор = Ссылка;               
	//	НоваяЗапись.ОперацияВыпуска = Ссылка;
	//	НоваяЗапись.Сотрудник = ЭтотОбъект.Исполнитель;
	//	НоваяЗапись.Смена = ЭтотОбъект.СменноеЗадание;
	//	//Часы Норма рассчитывается значение из вида работ указанного на вкладке "Трудозатраты" в реквизите "(бит) Время выполнения" * на Количество. 
	//	//Если нет установленных норм для соответствующего сочетания Номенклатуры/Оборудования/ТипаОперации, значение устанавливать "0" 
	//	//Количество автоматически пересчитывается по группе затрат соотнесенной с вкладкой "Продукция"
	//	
	//	НоваяЗапись.ЧасыНорма = 1;
	//	
	//	ЧасыФакт = 0;
	//	
	//	//Если ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
	//	//	ЧасыФакт = ТекСтрока.ВремяФакт / 60;
	//	//ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
	//	//	ЧасыФакт = ТекСтрока.ВремяФакт;
	//	//ИначеЕсли ТекСтрока.ЕдиницаИзмерения = Перечисления.ЕдиницыИзмеренияВремени.День Тогда	
	//	//	ЧасыФакт = ТекСтрока.ВремяФакт * 24;
	//	//КонецЕсли;
	//	
	//	НоваяЗапись.ЧасыФакт = ЧасыФакт;
	//	
	//	НоваяЗапись.КоличествоПлан = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");
	//	НоваяЗапись.КоличествоФакт = Ссылка.ВыходныеИзделия.Итог("КоличествоУпаковок");
	//	
	//	
	//КонецЕсли;
	//
	//НаборЗаписей.Записать();  
	
	// }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [24.11.2025] -
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьПоНормативамОперации")
Процедура бит_ЗаполнитьПоНормативамОперации(ДанныеЗаполнения, СохранитьИсполнителей, СохранитьСерии)

	Если СохранитьИсполнителей И НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		ДополнительныеСвойства.Вставить("Трудозатраты", Трудозатраты.Выгрузить());
	КонецЕсли;

	Если СохранитьСерии Тогда
		ДополнительныеСвойства.Вставить("ВыходныеИзделияСерии", ВыходныеИзделияСерии.Выгрузить());
		ДополнительныеСвойства.Вставить("ВыходныеИзделия", ВыходныеИзделия.Выгрузить());
		ДополнительныеСвойства.Вставить("МатериалыИРаботы", МатериалыИРаботы.Выгрузить());
	КонецЕсли;

	ОчиститьТабличныеЧасти();

	ВладелецОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "Владелец");
	Если ТипЗнч(ВладелецОперации) = Тип("СправочникСсылка.МаршрутныеКарты") Тогда
		ДанныеОперации  = ДанныеОперацииМаршрутнойКарты();
	Иначе
		ДанныеОперации  = ДанныеОперацииСпецификации(ДанныеЗаполнения);
	КонецЕсли;

	Если ДанныеОперации = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка расчета нормативов для заполнения операции.';
		|en = 'An error occurred when calculating standards for filling the operation.'");
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОперации, "ВидОперации, ВариантНаладки, МожноПовторить, МожноПропустить, Контроль");
	Если РабочийЦентр.Пустая() Тогда
		ДанныеОперации.КоэффициентВремениРаботы = 1;
	Иначе
		ДанныеОперации.КоэффициентВремениРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийЦентр, "КоэффициентВремениРаботы");
	КонецЕсли;

	Наименование = ДанныеОперации.ОперацияПредставление;
	РассчитатьВремяВыполнения(ДанныеОперации);

	Настройки = Документы.ПроизводственнаяОперация2_2.НастройкиУчета(
	Подразделение,
	ВладелецОперации);

	Если Настройки.ИспользоватьВыходныеИзделия Тогда

		Для каждого Строка Из ДанныеОперации.ВыходныеИзделия Цикл
			ЗаполнитьЗначенияСвойств(ВыходныеИзделия.Добавить(), Строка);
		КонецЦикла;
		Для каждого Строка Из ДанныеОперации.ВозвратныеОтходы Цикл
			ЗаполнитьЗначенияСвойств(ВыходныеИзделия.Добавить(), Строка);
		КонецЦикла;

	КонецЕсли;

	Если Настройки.ИспользоватьМатериалы Тогда

		ЗаполнитьМатериалыПоНормативам(ДанныеОперации.Материалы);

	КонецЕсли;
	         
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] +
	Если ТипЗнч(ДанныеЗаполнения) = Тип(Новый Структура)
		И ДанныеЗаполнения.Свойство("ЗаполнитьТрудозатратыТолькоПоФОТ") Тогда	
		ЗаполнитьТрудозатратыТолькоПоФОТ = Истина;
		СтатьяКалькуляцииФот = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.бит_СтатьиКалькуляцииФОТБезПремии, ЭтотОбъект, Истина)
	Иначе
		ЗаполнитьТрудозатратыТолькоПоФОТ = Ложь;
		СтатьяКалькуляцииФот = Справочники.СтатьиКалькуляции.ПустаяСсылка();
	КонецЕсли;	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] -
	
	Для каждого Строка Из ДанныеОперации.Трудозатраты Цикл
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] +
		Если ЗаполнитьТрудозатратыТолькоПоФОТ 
			И Строка.НазначениеРабот <> СтатьяКалькуляцииФот.Наименование Тогда
			Продолжить;
		КонецЕсли;
		#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.1] [ASHolyavko@1cbit.ru] [09.11.2025] -
		ЗаполнитьЗначенияСвойств(Трудозатраты.Добавить(), Строка);
	КонецЦикла;

	ВосстановитьИсполнителейТрудозатрат();

	ВосстановитьСерии();

	Документы.ПроизводственнаяОперация2_2.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект);

КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	УстановитьКлючВСтрокахТабличныхЧастей(Отказ);

	ДанныеДоИзменения =  ДанныеОперацииДоИзменения();
	ДополнительныеСвойства.Вставить("ДанныеДоИзменения", ДанныеДоИзменения);
	
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [09.12.2025] +        
	
	ИзменениеХодовВЗакрытомСменномЗадании = ДополнительныеСвойства.Свойство("ИзменениеХодовВЗакрытомСменномЗадании"); 
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [09.12.2025] -
	
	
	// Проверка объекта
	Если Не РежимГрупповойОбработки() Тогда
		
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [09.12.2025] +        
		
		Если Не ИзменениеХодовВЗакрытомСменномЗадании Тогда 
		
		#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [09.12.2025] -
		
		Если Не Этап.Пустая() Тогда

			СтатусЭтапа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Этап, "Статус");

			Если СтатусЭтапа = Перечисления.СтатусыЭтаповПроизводства2_2.Завершен Тогда

				ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Нельзя изменять операцию, принадлежащую завершенному этапу.';
				|en = 'You cannot modify an operation belonging to a completed stage.'"),
				ЭтотОбъект,
				"Этап",,
				Отказ);

			КонецЕсли;

		КонецЕсли;

		Если Не СменноеЗадание.Пустая() Тогда

			СтатусЗадания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СменноеЗадание, "Статус");

			Если СтатусЗадания = Перечисления.СтатусыСменныхЗаданий.Закрыто Тогда

				ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Нельзя изменять операцию, принадлежащую закрытому сменному заданию.';
				|en = 'Cannot change the operation that refers to a closed shift task.'"),
				ЭтотОбъект,
				"СменноеЗадание",,
				Отказ);

			КонецЕсли;

		КонецЕсли;
		
		#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [09.12.2025] +        
		
		КонецЕсли; 
		
		#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ6.1.3] [ASHolyavko@1cbit.ru] [09.12.2025] -
		
	КонецЕсли;

	// Заполнение реквизитов
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ПроизводственнаяОперация2_2);

	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.ВыходныеИзделия);
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, ПараметрыУказанияСерий.МатериалыИРаботы);

	Если Статус = Перечисления.СтатусыПроизводственныхОпераций.НеВыполнена
		ИЛИ Статус = Перечисления.СтатусыПроизводственныхОпераций.Пропущена Тогда

		ОчиститьТабличныеЧасти();

	КонецЕсли;

	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Для каждого Строка Из Трудозатраты Цикл
			Строка.Исполнитель = Исполнитель;
		КонецЦикла;
	КонецЕсли;

	ЗаполнитьНомер();

КонецПроцедуры
